src/config/InformationRegisters/СхемыНалогообложенияКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СхемыНалогообложенияКонтрагентов</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СхемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаПлательщикаЕдиногоНалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыПлательщиковЕдиногоНалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕдиногоНалога</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНалогаНаПрибыль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДСПриостановлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/InformationRegisters/Пактум_ФоновыеЗадания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>Пактум_ФоновыеЗадания</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>фОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/InformationRegisters/ОтветственныеЛицаКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛицаКонтрагентов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/InformationRegisters/Пактум_ДополнительныеСведенияОКонтрагентах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>Пактум_ДополнительныеСведенияОКонтрагентах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОтступ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Enums/ВидыКонтактныхЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыКонтактныхЛиц</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КонтактноеЛицоКонтрагента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееКонтактноеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныйКонтакт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Enums/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительКадровойСлужбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаБухгалтерскиеРегистры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Enums/ГруппыПлательщиковЕдиногоНалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ГруппыПлательщиковЕдиногоНалога</Name>
			<Comment>Группы плательщиков единого налога</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПерваяГруппа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВтораяГруппа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТретьяГруппа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТретьяГруппаОсобая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧетвертаяГруппа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПятаяГруппа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШестаяГруппа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Catalogs/КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>КонтактныеЛица</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиКонтактныхЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтактногоЛица</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКонтактныхЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательЛичногоКонтакта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/config/CommonModules/Пактум_ФоновыеЗадания/Ext/Module.bsl
Процедура ПолучитьКарточкуКонтрагента(Параметры) Экспорт
	ЗаписатьДанныеКонтрагента(Параметры);	
КонецПроцедуры

Процедура ЗаписатьДанныеКонтрагента(Параметры)
	КолЦиклов=Параметры.КолЦиклов;
	пЕДРПОУ=Параметры.ЕДРПОУ;
	Конфигурация=Параметры.Конфигурация;
	Токен=Параметры.Токен;
	
	Если КолЦиклов >18 тогда
		КолЦиклов = 0;
	КонецЕсли;
	Попытка
		Соединение = Новый HTTPСоединение("pactumsys.com", 443, , , Пактум_Сервер.ПолучитьПрокси(), 20, Пактум_Сервер.ПолучитьSSL());
		Запрос = Новый HTTPЗапрос("/api/v1/cba2911c-01f9-4ca7-833a-46fb0cc079f2/contractors/"+пЕДРПОУ+"?source=bas");
		Запрос.Заголовки.Вставить("Accept-Language",  "ru");
		Запрос.Заголовки.Вставить("Content-Language", "ru");
		Запрос.Заголовки.Вставить("Accept-Charset",   "utf-8");
		Запрос.Заголовки.Вставить("Content-Charset",  "utf-8");
		Запрос.Заголовки.Вставить("Content-type",     "application/x-www-form-urlencoded; charset=utf-8");
		Запрос.Заголовки.Вставить("Authorization", "Bearer "+Токен);
		
		Ответ = Соединение.Получить(Запрос);
		ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
	Исключение
	КонецПопытки;
	
	ЧтениеJSON = Новый ЧтениеJSON; 
	ЧтениеJSON.УстановитьСтроку(ТекстОтвета);
	Контрагент = ПрочитатьJSON(ЧтениеJSON);
	
	Если Контрагент.Свойство("Status") Тогда	//Все ОК
		пСтатус1=""; пСтатус2=""; пСтатус3="";
		Для Каждого ст Из Контрагент.RegisterStates Цикл
			Если ст.RegisterId = 1 Тогда	//ЕДР
				пСтатус1 = ст.Status;
			ИначеЕсли ст.RegisterId = 2 Тогда	//ЕН
				пСтатус2 = ст.Status;
			ИначеЕсли ст.RegisterId = 3 Тогда	//НДС
				пСтатус3 = ст.Status;
			КонецЕсли;
		КонецЦикла;
		Если пСтатус1="Done" И пСтатус2="Done" И пСтатус3="Done" Тогда
			ЗаполнитьКонтрагента(Контрагент, Параметры);
			Пактум_ЗавершениеПоиска(Параметры, Ложь, Контрагент.Message);
			КолЦиклов=0;
		ИначеЕсли КолЦиклов < 18  тогда
			Sleep(10);
			Параметры.КолЦиклов =КолЦиклов+1;
			ПолучитьКарточкуКонтрагента(Параметры);
		Иначе
			СтатусЕДР=пСтатус1;	//ЕДР должен ответить...
			Если СтатусЕДР = "Done" Тогда
				ЗаполнитьКонтрагента(Контрагент, Параметры);
			КонецЕсли;
			
			КодОшибки=0;
			ТекстОшибки="";
			Для Каждого ст Из Контрагент.RegisterStates Цикл
				Если ст.Status ="Done" Тогда
					Продолжить;
				КонецЕсли;
				Если ст.RegisterId = 1 Тогда		//ЕДР
					КонтрагентСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("КодПоЕДРПОУ", пЕДРПОУ);
					Если КонтрагентСсылка = Справочники.Контрагенты.ПустаяСсылка() Тогда
						КодОшибки=4;
					Иначе
						КодОшибки=5;
					КонецЕсли;
				ИначеЕсли ст.RegisterId = 2 Тогда	//ЕН
					Если КодОшибки=0 Тогда
						КодОшибки=1;
					Иначе
						Если КодОшибки<4 Тогда
							КодОшибки=3;
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли ст.RegisterId = 3 Тогда	//НДС
					Если КодОшибки=0 Тогда
						КодОшибки=2;
					Иначе
						Если КодОшибки<4 Тогда
							КодОшибки=3;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если КодОшибки=0 Тогда
				КонтрагентСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("КодПоЕДРПОУ", пЕДРПОУ);
				Если КонтрагентСсылка = Справочники.Контрагенты.ПустаяСсылка() Тогда
					КодОшибки=4;
				Иначе
					КодОшибки=5;
				КонецЕсли;
			КонецЕсли;
			ТекстОшибки=ПолучитьТекстОшибкиРеестров(КодОшибки);
			Если Не ПустаяСтрока(Контрагент.Message) Тогда
				ТекстОшибки = ТекстОшибки + Символы.ПС + Контрагент.Message;
			КонецЕсли;
			Пактум_ЗавершениеПоиска(Параметры, Истина, ТекстОшибки);
			КолЦиклов = 0;
		КонецЕсли;
	Иначе
		Пактум_ЗавершениеПоиска(Параметры, Истина, Контрагент.Message);
		КолЦиклов = 0;
	КонецЕсли;
	Параметры.Вставить("КолЦиклов", КолЦиклов);
КонецПроцедуры

Процедура Sleep(сек)
	нач=ТекущаяДата();
	Пока ТекущаяДата() - нач < сек Цикл
	КонецЦикла;    
КонецПроцедуры

Процедура ЗаписатьИнформациюОЗавершении(Параметры, фОшибки=Ложь, ТекстОшибки="")
	Если Не фОшибки Тогда
		//Запишем Налогообложение
		Если Параметры.Свойство("СистемаНалогообложения") Тогда
			Если ЗначениеЗаполнено(Параметры.СистемаНалогообложения) Тогда
				КонтрагентСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("КодПоЕДРПОУ", Параметры.ЕДРПОУ);
				Если Параметры.Конфигурация="УНФ" Тогда
					НаборЗаписей = РегистрыСведений.СистемыНалогообложенияКонтрагентов.СоздатьНаборЗаписей();
					ИмяРекв="СистемаНалогообложения";
				ИначеЕсли Параметры.Конфигурация="БП" Тогда
					НаборЗаписей = РегистрыСведений.СхемыНалогообложенияКонтрагентов.СоздатьНаборЗаписей();  			
					ИмяРекв="СхемаНалогообложения";
				КонецЕсли;
				НаборЗаписей.Отбор.Период.Установить(Параметры.ПериодНалогообложения);
				НаборЗаписей.Отбор.Контрагент.Установить(КонтрагентСсылка);
				НаборЗаписей.Прочитать();
				Если НаборЗаписей.Количество() = 0 Тогда
					НовыйНомер = НаборЗаписей.Добавить();
					НовыйНомер.Контрагент = КонтрагентСсылка;
					НовыйНомер.Период = Параметры.ПериодНалогообложения;
					НовыйНомер[ИмяРекв] = Параметры.СистемаНалогообложения;
				ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
					НовыйНомер = НаборЗаписей[0];
					НовыйНомер.Контрагент = КонтрагентСсылка;
					НовыйНомер.Период = Параметры.ПериодНалогообложения;
					НовыйНомер[ИмяРекв] = Параметры.СистемаНалогообложения;
				КонецЕсли;
				НаборЗаписей.Записать();	
			КонецЕсли;
			
			Если Параметры.ОчиститьИНН Тогда
				Об=КонтрагентСсылка.ПолучитьОбъект();
				Об.ИНН="";
				Об.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	пНабор=РегистрыСведений.Пактум_ФоновыеЗадания.СоздатьНаборЗаписей();
	Попытка
		НовСтр=пНабор.Добавить();
		НовСтр.УИД=Параметры.УИД;
		НовСтр.фОшибки=фОшибки;
		НовСтр.ТекстОшибки=ТекстОшибки;
		пНабор.Записать();
	Исключение
	КонецПопытки;
КонецПроцедуры

Процедура ЗаполнитьКонтрагента(Контрагент, Параметры)
	Конфигурация=Параметры.Конфигурация;
	пЕДРПОУ=Параметры.ЕДРПОУ;
	
	Налогообложение=Новый Структура;
	Налогообложение.Вставить("СистемаНалогообложения", Неопределено);
	Налогообложение.Вставить("СистемаНалогообложенияТекст", "");
	Налогообложение.Вставить("ПериодНалогообложения", Дата(1, 1, 1, 0, 0, 0));
	Налогообложение.Вставить("ОчиститьИНН", Ложь);
	Параметры.Вставить("Налогообложение", Налогообложение);
	
	Попытка
	  	КонтрагентСсылка=Параметры.КонтрагентСсылка;
		Контрагенты = КонтрагентСсылка.ПолучитьОбъект();
		Контрагенты.Наименование = Контрагент.Name;
		Контрагенты.НаименованиеПолное = Контрагент.FullName;
		Контрагенты.КодПоЕДРПОУ = СокрЛП(Контрагент.Identifier);
		
		ЗаписатьДополнительныеСведенияКонтрагентов(КонтрагентСсылка, Контрагент);
		 
		Если Конфигурация = "УНФ" тогда
			Контрагенты.ИНН = СокрЛП(Контрагент.IndividualTaxNumber);
			Если ЗначениеЗаполнено(Контрагент.VatCertificate) Тогда
				Контрагенты.НомерСвидетельства = Контрагент.VatCertificate;
			КонецЕсли;
			Контрагенты.НомерТелефона = 	Контрагент.Phone;
			Контрагенты.АдресЭП = 	Контрагент.Email;
			Контрагенты.СтранаРегистрации = Справочники.СтраныМира.Украина;
			Контрагенты.ВидКонтрагента  = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
			Если Не Контрагент.IsFop = Неопределено Тогда
				Если Контрагент.IsFop = Истина Тогда
					Контрагенты.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель;	
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Лев(Конфигурация, 2) = "БП"  тогда
			Контрагенты.инн = СокрЛП(Контрагент.IndividualTaxNumber);
			Контрагенты.ЮридическоеФизическоеЛицо  = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
			Если Не Контрагент.IsFop = Неопределено Тогда
				Если Контрагент.IsFop = Истина Тогда
					Контрагенты.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;	
				КонецЕсли;
			КонецЕсли;
		Иначе	
			Контрагенты.ИННПлательщикаНДС = СокрЛП(Контрагент.IndividualTaxNumber);
			Контрагенты.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
			Если Не Контрагент.IsFop = Неопределено Тогда
				Если Контрагент.IsFop = Истина Тогда
					Если Конфигурация = "УТ" тогда
						Контрагенты.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель;	
					Иначе
						Контрагенты.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;	
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(Контрагент.VatCertificate) Тогда
				Контрагенты.НомерСвидетельстваПлательщикаНДС = Контрагент.VatCertificate;
			КонецЕсли;
			Если Контрагенты.Партнер = Справочники.Партнеры.ПустаяСсылка() тогда
				Партнер = Справочники.Партнеры.СоздатьЭлемент();
				Партнер.Наименование = Контрагент.Name;
				Партнер.НаименованиеПолное = Контрагент.FullName;
				Если СтрДлина(Контрагент.Identifier) = 10 тогда
					Партнер.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо;
				Иначе
					Партнер.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Партнер.ДатаРегистрации) Тогда
					Партнер.ДатаРегистрации=ТекущаяДата();
				КонецЕсли;
				Партнер.Записать();
				Контрагенты.Партнер  =  Партнер.Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		Контрагенты.КонтактнаяИнформация.Очистить();
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.Адрес);
		СтруктураОтбора.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
		Массив = Контрагенты.КонтактнаяИнформация.НайтиСтроки(СтруктураОтбора);
		Если Массив.Количество() = 0 тогда
			Стр = Контрагенты.КонтактнаяИнформация.Добавить();	
			Стр.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
			Стр.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
		иначе
			Стр = Массив[0];
		КонецЕсли;
		Если Контрагент.IsAddressElements=0 Тогда
			Стр.Представление = Контрагент.Address;
		Иначе
			СтруЗначенияПолей = Новый Структура;
			СтруЗначенияПолей.Вставить("Индекс", 			Контрагент.Address_zip);
			СтруЗначенияПолей.Вставить("Страна", 			Контрагент.Address_country);
			СтруЗначенияПолей.Вставить("НаселенныйПункт", 	Контрагент.Address_atu);
			СтруЗначенияПолей.Вставить("Улица", 			Контрагент.Address_street);
			СтруЗначенияПолей.Вставить("ТипДома", 			Адрес_ТипДома(Контрагент.Address_house_type));
			СтруЗначенияПолей.Вставить("Дом", 				Контрагент.Address_house);
			СтруЗначенияПолей.Вставить("ТипКорпуса", 		Адрес_ТипКорпуса(Контрагент.Address_building_type));
			СтруЗначенияПолей.Вставить("Корпус", 			Контрагент.Address_building);
			СтруЗначенияПолей.Вставить("ТипКвартиры", 		Адрес_ТипКвартиры(Контрагент.Address_num_type));
			СтруЗначенияПолей.Вставить("Квартира", 			Контрагент.Address_num);
			СтруЗначенияПолей.Вставить("Представление",		Контрагент.Address); 
			
			АдресСтрокойВJSON = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(СтруЗначенияПолей, Перечисления.ТипыКонтактнойИнформации.Адрес);
			Стр.Значение = АдресСтрокойВJSON;
			Стр.Представление = Контрагент.Address; 
			
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.Адрес);
			СтруктураОтбора.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента);
			Массив = Контрагенты.КонтактнаяИнформация.НайтиСтроки(СтруктураОтбора);
			Если Массив.Количество() = 0 Тогда
				Стр = Контрагенты.КонтактнаяИнформация.Добавить();	
				Стр.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
				Стр.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента;
				Стр.Значение = АдресСтрокойВJSON; 
				Стр.Представление = Контрагент.Address;
			КонецЕсли;
		КонецЕсли;
		
		ЕстьФакс = Ложь;
		Если Не Контрагент.Phones = Неопределено И Контрагент.Phones.Количество() > 0 Тогда
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);
			СтруктураОтбора.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
			Массив = Контрагенты.КонтактнаяИнформация.НайтиСтроки(СтруктураОтбора);
			
			Для А = 0 По Контрагент.Phones.Количество() - 1 Цикл
				Если Контрагент.Phones[А].IsFax Тогда
					ЕстьФакс = Истина;
					Продолжить;
				КонецЕсли;
				ТелНомер = Контрагент.Phones[А].Original;
				Если ПустаяСтрока(ТелНомер) Тогда
					Продолжить;
				КонецЕсли;
			
				Если Массив.Количество() < А + 1 Тогда
					Стр = Контрагенты.КонтактнаяИнформация.Добавить();	
					Стр.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
					Стр.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
				Иначе
					Стр = Массив[А];
				КонецЕсли;
				Стр.Представление = ТелНомер;
				Стр.НомерТелефона = ТелНомер;
				КодыТелефона = Контрагент.Phones[А]; 
				Стр.Значение = "";
				Стр.НомерТелефонаБезКодов = КодыТелефона.Number;
				Стр.ЗначенияПолей = "<КонтактнаяИнформация xmlns=""http://www.v8.1c.ru/ssl/contactinfo"" xmlns:xs=""http://www.w3.org/2001/XMLSchema""" + 
									" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" Представление=""" + ТелНомер + 
									"""><Комментарий/><Состав xsi:type=""НомерТелефона"" КодСтраны=""+" +КодыТелефона.CountryCode + 
									""" КодГорода=""" + КодыТелефона.Code + """ Номер=""" + КодыТелефона.Number + 
									""" Добавочный=""""/></КонтактнаяИнформация>";
			КонецЦикла;
		КонецЕсли;
	
		Если ЕстьФакс Тогда
			СтруктураОтбора = Новый Структура;
			//СтруктураОтбора.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.Факс);
			Попытка
				ФаксКонтрагентаВид = Справочники.ВидыКонтактнойИнформации.ФаксКонтрагенты;
			Исключение
				ФаксКонтрагентаВид = Справочники.ВидыКонтактнойИнформации.ФаксКонтрагента;
			КонецПопытки;
			СтруктураОтбора.Вставить("Вид", ФаксКонтрагентаВид);
			Массив = Контрагенты.КонтактнаяИнформация.НайтиСтроки(СтруктураОтбора);
			Для А = 0 По Контрагент.Phones.Количество() - 1 Цикл
				Если Не Контрагент.Phones[А].IsFax Тогда
					Продолжить;
				КонецЕсли;
				ТелНомер = Контрагент.Phones[А].Original;
				Если ПустаяСтрока(ТелНомер) Тогда
					Продолжить;
				КонецЕсли;
				
				Если Массив.Количество() = 0 тогда
					Стр = Контрагенты.КонтактнаяИнформация.Добавить();	
					Стр.Тип = Перечисления.ТипыКонтактнойИнформации.Факс;
					Стр.Вид = ФаксКонтрагентаВид;
				Иначе
					Стр = Массив[0];
				КонецЕсли;
				Стр.Представление = ТелНомер;
				Стр.НомерТелефона = ТелНомер;
				КодыТелефона = Контрагент.Phones[А];
				Стр.Значение = "";
				Стр.НомерТелефонаБезКодов = КодыТелефона.Number;
				Стр.ЗначенияПолей = "<КонтактнаяИнформация xmlns=""http://www.v8.1c.ru/ssl/contactinfo"" xmlns:xs=""http://www.w3.org/2001/XMLSchema""" + 
									" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" Представление=""" + ТелНомер + 
									"""><Комментарий/><Состав xsi:type=""НомерФакса"" КодСтраны=""+" +КодыТелефона.CountryCode + 
									""" КодГорода=""" + КодыТелефона.Code + """ Номер=""" + КодыТелефона.Number + 
									""" Добавочный=""""/></КонтактнаяИнформация>";
			КонецЦикла;
		КонецЕсли;
	
		Если Не ПустаяСтрока(Контрагент.Contacts_Email) Тогда
			Если Лев(Конфигурация, 2) = "БП"  тогда
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
				СтруктураОтбора.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.EmailКонтрагенты);
				Массив = Контрагенты.КонтактнаяИнформация.НайтиСтроки(СтруктураОтбора);
				Если Массив.Количество() = 0 тогда
					Стр = Контрагенты.КонтактнаяИнформация.Добавить();	
					Стр.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
					Стр.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтрагенты;
					Стр.Представление = Контрагент.Contacts_Email;
					Стр.АдресЭП 	  =	Контрагент.Contacts_Email;
					
				Иначе
					Стр = Массив[0];
					Стр.Представление = Контрагент.Contacts_Email;
					Стр.АдресЭП = 		Контрагент.Contacts_Email;
				КонецЕсли;
			Иначе
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
				СтруктураОтбора.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.EmailКонтрагента);
				Массив = Контрагенты.КонтактнаяИнформация.НайтиСтроки(СтруктураОтбора);
				Если Массив.Количество() = 0 Тогда
					Стр = Контрагенты.КонтактнаяИнформация.Добавить();	
					Стр.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
					Стр.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
					Стр.Представление = Контрагент.Contacts_Email;
					Стр.АдресЭП = 		Контрагент.Contacts_Email;
					
				Иначе
					Стр = Массив[0];
					Стр.Представление = Контрагент.Contacts_Email;
					Стр.АдресЭП = 		Контрагент.Contacts_Email;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Контрагенты.Записать();
		Параметры.КонтрагентСсылка = Контрагенты.Ссылка;
		
		//
		//Партнеры...
		Попытка
			Партнер=Контрагенты.Партнер;
			ОбПартнер=Партнер.ПолучитьОбъект();
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.Адрес);
			СтруктураОтбора.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.АдресПартнера);
			Массив = ОбПартнер.КонтактнаяИнформация.НайтиСтроки(СтруктураОтбора);
			Если Массив.Количество() = 0 тогда
				Стр = ОбПартнер.КонтактнаяИнформация.Добавить();	
				Стр.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
				Стр.Вид = Справочники.ВидыКонтактнойИнформации.АдресПартнера;
				Стр.Представление = Контрагент.Address;
			иначе
				Стр = Массив[0];
				Стр.Представление = Контрагент.Address;	
			КонецЕсли;
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);
			СтруктураОтбора.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.ТелефонПартнера);
			Массив = ОбПартнер.КонтактнаяИнформация.НайтиСтроки(СтруктураОтбора);
			Если Массив.Количество() = 0 тогда
				Стр = ОбПартнер.КонтактнаяИнформация.Добавить();	
				Стр.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
				Стр.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонПартнера;
				Стр.Представление = 	Контрагент.Phone;
				Стр.НомерТелефона = 	Контрагент.Phone;
			иначе
				Стр = Массив[0];
				Стр.Представление = 	Контрагент.Phone;
				Стр.НомерТелефона = 	Контрагент.Phone;
			КонецЕсли;
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			СтруктураОтбора.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.EmailПартнера);
			Массив = ОбПартнер.КонтактнаяИнформация.НайтиСтроки(СтруктураОтбора);
			Если Массив.Количество() = 0 тогда
				Стр = ОбПартнер.КонтактнаяИнформация.Добавить();	
				Стр.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
				Стр.Вид = Справочники.ВидыКонтактнойИнформации.EmailПартнера;
				Стр.Представление 	= 	Контрагент.Email;
				Стр.АдресЭП 	 	= 	Контрагент.Email;
			иначе
				Стр = Массив[0];
				Стр.Представление 	= 	Контрагент.Email;
				Стр.АдресЭП 		= 	Контрагент.Email;
			КонецЕсли;
			ОбПартнер.Записать();
		Исключение
		КонецПопытки;
		
		спКонтакты=ПолучитьКонтактыКонтрагента(Контрагент);
		Если спКонтакты.Количество()>0 Тогда
			Для Х=1 По спКонтакты.Количество() Цикл
				пКонтакт=спКонтакты[Х-1];
				Если Конфигурация = "УНФ" тогда
					КонтактныеЛицаКонтрагентаСсылка = Справочники.КонтактныеЛица.НайтиПоНаименованию(пКонтакт.Значение,,,Контрагенты.Ссылка);
					Если КонтактныеЛицаКонтрагентаСсылка = Справочники.КонтактныеЛица.ПустаяСсылка() тогда
						КонтактныеЛицаКонтрагента = Справочники.КонтактныеЛица.СоздатьЭлемент();
					Иначе
						КонтактныеЛицаКонтрагента = КонтактныеЛицаКонтрагентаСсылка.ПолучитьОбъект();
					КонецЕсли;				
					КонтактныеЛицаКонтрагента.Владелец =Контрагенты.Ссылка;
					КонтактныеЛицаКонтрагента.Наименование =пКонтакт.Значение; 
					КонтактныеЛицаКонтрагента.Записать();
				ИначеЕсли Лев(Конфигурация, 2)  = "БП" тогда
					Зап=Новый Запрос;
					Зап.Текст=
					"ВЫБРАТЬ
					|	КонтактныеЛица.Ссылка
					|ИЗ
					|	Справочник.КонтактныеЛица КАК КонтактныеЛица
					|ГДЕ
					|	КонтактныеЛица.Наименование = &Наименование
					|	И КонтактныеЛица.ОбъектВладелец = &ОбъектВладелец
					|	И КонтактныеЛица.ВидКонтактногоЛица = &ВидКонтактногоЛица";
					Зап.УстановитьПараметр("Наименование", пКонтакт.Значение);
					Зап.УстановитьПараметр("ОбъектВладелец", Контрагенты.Ссылка);
					Зап.УстановитьПараметр("ВидКонтактногоЛица", Перечисления.ВидыКонтактныхЛиц.КонтактноеЛицоКонтрагента);
					Рез=Зап.Выполнить();
					Если Рез.Пустой() Тогда
						КонтактныеЛица = Справочники.КонтактныеЛица.СоздатьЭлемент();
					 Иначе
						Выб=Рез.Выбрать();
						Выб.Следующий();
						КонтактныеЛица = Выб.Ссылка.ПолучитьОбъект(); 
					КонецЕсли;
				    Если Х=1 Тогда
						КонтактныеЛица.Фамилия = Контрагент.DirectorLastName;
						КонтактныеЛица.Имя = Контрагент.DirectorFirstName;
						КонтактныеЛица.Отчество = Контрагент.DirectorMiddleName;
				    КонецЕсли;
					КонтактныеЛица.ОбъектВладелец =Контрагенты.Ссылка;
					КонтактныеЛица.Наименование =пКонтакт.Значение; 
					КонтактныеЛица.ВидКонтактногоЛица=Перечисления.ВидыКонтактныхЛиц.КонтактноеЛицоКонтрагента;
					КонтактныеЛица.Записать();
					Если Конфигурация="БП2" Тогда
						Если Х=1 Тогда
							Попытка
								НаборЗаписей = РегистрыСведений.ОтветственныеЛицаКонтрагентов.СоздатьНаборЗаписей();
								НаборЗаписей.Отбор.Контрагент.Установить(Контрагенты.Ссылка);
								НаборЗаписей.Отбор.ОтветственноеЛицо.Установить(Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
								НаборЗаписей.Прочитать();
								фНужноДобавить=Истина;
								Если НаборЗаписей.Количество() > 0 Тогда 
									ТекЗапись=НаборЗаписей[0];
									Если ТекЗапись.КонтактноеЛицо=КонтактныеЛица.Ссылка Тогда
										фНужноДобавить=Ложь;
									КонецЕсли;
								КонецЕсли;
								Если фНужноДобавить Тогда
									ТекЗапись=НаборЗаписей.Добавить();
									ТекЗапись.Период=ТекущаяДата();
									ТекЗапись.Контрагент=Контрагенты.Ссылка;
									ТекЗапись.ОтветственноеЛицо=Перечисления.ОтветственныеЛицаОрганизаций.Руководитель;
									ТекЗапись.КонтактноеЛицо=КонтактныеЛица.Ссылка;
									ТекЗапись.Активность=Истина;
									НаборЗаписей.Записать();
								КонецЕсли;
							Исключение
							КонецПопытки;
						КонецЕсли;
					КонецЕсли;
				Иначе
					КонтактныеЛицаКонтрагентаСсылка = Справочники.КонтактныеЛицаПартнеров.НайтиПоНаименованию(пКонтакт.Значение,,,Контрагенты.Партнер);
					Если КонтактныеЛицаКонтрагентаСсылка = Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка() тогда
						КонтактныеЛицаКонтрагента = Справочники.КонтактныеЛицаПартнеров.СоздатьЭлемент();
					Иначе
						КонтактныеЛицаКонтрагента = КонтактныеЛицаКонтрагентаСсылка.ПолучитьОбъект();
					КонецЕсли;				
					КонтактныеЛицаКонтрагента.Владелец =Контрагенты.Партнер;
					КонтактныеЛицаКонтрагента.Наименование =пКонтакт.Значение; 
					КонтактныеЛицаКонтрагента.Автор = ПараметрыСеанса.ТекущийПользователь; 
					КонтактныеЛицаКонтрагента.Записать();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ПолучитьНалогообложение(Контрагент, Параметры);
	Исключение
	КонецПопытки;
КонецПроцедуры

Функция ПолучитьКонтактыКонтрагента(Контрагент)
	Сп=Новый СписокЗначений;
	//Первый - директор, есть в структуре
	пФИО1="";
	Если Не Контрагент.DirectorLastName=Неопределено Тогда
		пФИО1=СокрЛП(Контрагент.DirectorLastName);
	КонецЕсли;
	пФИО2="";
	Если Не Контрагент.DirectorFirstName=Неопределено Тогда
		пФИО2=СокрЛП(Контрагент.DirectorFirstName);
	КонецЕсли;
	пФИО3="";
	Если Не Контрагент.DirectorMiddleName=Неопределено Тогда
		пФИО3=СокрЛП(Контрагент.DirectorMiddleName);
	КонецЕсли;
	Если Не пФИО1+пФИО2+пФИО3="" Тогда
		Сп.Добавить(пФИО1+" "+пФИО2+" "+пФИО3);
	Иначе
		Если Не Контрагент.IsFop = Неопределено И Контрагент.IsFop Тогда
			Сп.Добавить(СокрЛП(Контрагент.Name));		
		КонецЕсли;
	КонецЕсли;

	СтрДанные 		= Контрагент.DirectorInformation;
	ДлинаСтроки 	= СтрДлина(СтрДанные);
	фОбработаноВсе 	= Ложь;
	пТекНомПоз 		= 1;
	Пока Не фОбработаноВсе Цикл
		пРабочаяСтрока=Сред(СтрДанные, пТекНомПоз, ДлинаСтроки);
		пНомПоз=Найти(пРабочаяСтрока, ";");
		Если пНомПоз = 0 Тогда
			фОбработаноВсе = Истина;
		Иначе
			пТекНомПоз = пТекНомПоз + пНомПоз;
			пРабочаяСтрока = Сред(пРабочаяСтрока, 1, пНомПоз);
			Если Лев(пРабочаяСтрока, 1) = " " Тогда
				пРабочаяСтрока = Сред(пРабочаяСтрока, 2, пНомПоз);
				пТекНомПоз = пТекНомПоз + 1;
			КонецЕсли;
		КонецЕсли;
		Если пРабочаяСтрока = "" Тогда
			Продолжить;
		КонецЕсли;
		пНомПоз = Найти(пРабочаяСтрока, " - ");
		Если пНомПоз > 0 Тогда
			пРабочаяСтрока = СокрЛП(Лев(пРабочаяСтрока, пНомПоз - 1));
		КонецЕсли;
		Если Сп.НайтиПоЗначению(пРабочаяСтрока) = Неопределено Тогда
			Сп.Добавить(пРабочаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Сп;
КонецФункции

Процедура ПолучитьНалогообложение(Контрагент, Параметры)
	ТекДата = ТекущаяДата();
	
	Параметры.Налогообложение.Вставить("ОчиститьИНН", Ложь);
	ДатаСтарт = Контрагент.CompanyStartDate;
	Если ДатаСтарт=Неопределено Тогда
		ДатаСтарт=Дата(2, 1, 1, 0, 0, 0);
	Иначе
		ДатаСтарт=Дата(Число(Сред(ДатаСтарт,7,4)),Число(Сред(ДатаСтарт,4,2)),Число(Сред(ДатаСтарт,1,2)));
		Если ДатаСтарт > ТекДата Тогда
			ДатаСтарт=Дата(2, 1, 1, 0, 0, 0);	
		КонецЕсли;
	КонецЕсли;
	ДатаРегистрацииНДС = Контрагент.VatRegistrationDate;
	Если Не ДатаРегистрацииНДС=Неопределено Тогда
		ДатаРегистрацииНДС = Дата(Число(Сред(ДатаРегистрацииНДС,7,4)),Число(Сред(ДатаРегистрацииНДС,4,2)),Число(Сред(ДатаРегистрацииНДС,1,2)));
		Если ДатаРегистрацииНДС > ТекДата Тогда
			ДатаРегистрацииНДС = ДатаСтарт;
			Параметры.Налогообложение.Вставить("ОчиститьИНН", Истина);
		КонецЕсли;
	Иначе
		ДатаРегистрацииНДС = ДатаСтарт;
	КонецЕсли;
	ДатаАннуляцииНДС = Контрагент.VATCancellationDate;
	Если Не ДатаАннуляцииНДС = Неопределено Тогда
		ДатаАннуляцииНДС = Дата(Число(Сред(ДатаАннуляцииНДС,7,4)),Число(Сред(ДатаАннуляцииНДС,4,2)),Число(Сред(ДатаАннуляцииНДС,1,2)));
		Если ДатаАннуляцииНДС > ТекДата Тогда
			ДатаАннуляцииНДС = ДатаСтарт;
		КонецЕсли;
	Иначе
		ДатаАннуляцииНДС = Дата(2, 1, 1, 0, 0, 0);
	КонецЕсли;
	
	ДатаЕдиныйНалог = Контрагент.SingleTaxStartDate;
	Если Не ДатаЕдиныйНалог = Неопределено Тогда
		ДатаЕдиныйНалог = Дата(Число(Сред(ДатаЕдиныйНалог,7,4)),Число(Сред(ДатаЕдиныйНалог,4,2)),Число(Сред(ДатаЕдиныйНалог,1,2)));
		Если ДатаЕдиныйНалог > ТекДата Тогда
			ДатаЕдиныйНалог = ДатаСтарт;
		КонецЕсли;
	Иначе
		ДатаЕдиныйНалог = ДатаСтарт;
	КонецЕсли;
	
	ДатаАннуляцииЕН = Контрагент.SingleTaxEndDate;
	Если Не ДатаАннуляцииЕН = Неопределено Тогда
		ДатаАннуляцииЕН = Дата(Число(Сред(ДатаАннуляцииЕН,7,4)),Число(Сред(ДатаАннуляцииЕН,4,2)),Число(Сред(ДатаАннуляцииЕН,1,2)));
		Если ДатаАннуляцииЕН > ТекДата Тогда
			ДатаАннуляцииЕН = ДатаСтарт;
		КонецЕсли;
	Иначе
		ДатаАннуляцииЕН = ДатаСтарт;
	КонецЕсли;
	
	ПериодНалогообложения = Макс(Мин(ДатаСтарт, ТекДата), Мин(ДатаРегистрацииНДС, ТекДата), Мин(ДатаАннуляцииНДС, ТекДата)
								, Мин(ДатаЕдиныйНалог, ТекДата), Мин(ДатаАннуляцииЕН, ТекДата));
	ПериодНалогообложения = НачалоМесяца(ПериодНалогообложения);
	Параметры.Налогообложение.Вставить("ПериодНалогообложения", ПериодНалогообложения);
	Если Контрагент.TaxSystem = "Єдиний податок" Тогда
		Если Контрагент.IndividualTaxNumber = Неопределено Тогда
			Параметры.Налогообложение.Вставить("СистемаНалогообложенияТекст", "ЕдиныйНалог");
		Иначе
			Если ДатаРегистрацииНДС <= ДатаАннуляцииНДС Тогда
				Параметры.Налогообложение.Вставить("СистемаНалогообложенияТекст", "ЕдиныйНалог");
			Иначе
				Параметры.Налогообложение.Вставить("СистемаНалогообложенияТекст", "ЕдиныйНалогИНДС");
			КонецЕсли;
		КонецЕсли;
		
		ГруппаНалогоОбложения = Перечисления.ГруппыПлательщиковЕдиногоНалога.ПустаяСсылка();
		ГруппаЗначение = Число(Контрагент.SingleTaxGroup);
		ГруппаПроцент = Число(Контрагент.SingleTaxRate);
		Если ГруппаЗначение = 1 Тогда
			ГруппаНалогоОбложения = Перечисления.ГруппыПлательщиковЕдиногоНалога.ПерваяГруппа;
		ИначеЕсли ГруппаЗначение = 2 Тогда
			ГруппаНалогоОбложения = Перечисления.ГруппыПлательщиковЕдиногоНалога.ВтораяГруппа;	
		ИначеЕсли ГруппаЗначение = 3 Тогда
			Если ГруппаПроцент = 2 Тогда
				ГруппаНалогоОбложения = Перечисления.ГруппыПлательщиковЕдиногоНалога.ТретьяГруппаОсобая;
			Иначе
				ГруппаНалогоОбложения = Перечисления.ГруппыПлательщиковЕдиногоНалога.ТретьяГруппа;	
			КонецЕсли;
		ИначеЕсли ГруппаЗначение = 4 Тогда
			ГруппаНалогоОбложения = Перечисления.ГруппыПлательщиковЕдиногоНалога.ЧетвертаяГруппа;
		ИначеЕсли ГруппаЗначение = 5 Тогда
			ГруппаНалогоОбложения = Перечисления.ГруппыПлательщиковЕдиногоНалога.ПятаяГруппа;
		ИначеЕсли ГруппаЗначение = 6 Тогда
			ГруппаНалогоОбложения = Перечисления.ГруппыПлательщиковЕдиногоНалога.ШестаяГруппа;
		КонецЕсли;
		Параметры.Налогообложение.Вставить("ГруппаНалогоОбложения", ГруппаНалогоОбложения);
	ИначеЕсли Контрагент.TaxSystem = "Податок на прибуток" Тогда
		Если Контрагент.IndividualTaxNumber = Неопределено Тогда
			Параметры.Налогообложение.Вставить("СистемаНалогообложенияТекст", "НалогНаПрибыль");
		Иначе		
			Если ДатаРегистрацииНДС <= ДатаАннуляцииНДС Тогда
				Параметры.Налогообложение.Вставить("СистемаНалогообложенияТекст", "НалогНаПрибыль");
			Иначе
				Параметры.Налогообложение.Вставить("СистемаНалогообложенияТекст", "НалогНаПрибыльИНДС");
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Контрагент.TaxSystem = "Неплатник" Тогда
		Параметры.Налогообложение.Вставить("ПериодНалогообложения", НачалоМесяца(ДатаСтарт));
		Параметры.Налогообложение.Вставить("СистемаНалогообложенияТекст", "НеПлательщик");
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьТекстОшибкиРеестров(КодОшибки)
	Если КодОшибки=1 Тогда
		Возврат НСтр("ru='К сожалению, на данный момент реестр единого налога работает нестабильно. 
				|Карточка контрагента сформирована без заполнения данных по налогообложению. 
				|Запустите повторно заполнение карточки через несколько минут. При повторном заполнении карточки сегодня до 23:59 Ваш баланс не уменьшится.'
				|;uk='На жаль, на даний момент реєстр єдиного податку працює нестабільно.
    			| Картка контрагента сформована без заповнення даних з оподаткування.
    			| Запустіть повторно заповнення картки через кілька хвилин. При повторному заповненні картки сьогодні до 23:59 Ваш баланс не зменшиться.'");
	ИначеЕсли КодОшибки=2 Тогда
		Возврат	НСтр("ru='К сожалению, на данный момент реестр НДС работает нестабильно. 
				|Карточка контрагента сформирована без заполнения данных по налогообложению. 
				|Запустите повторно заполнение карточки через несколько минут. При повторном заполнении карточки сегодня до 23:59 Ваш баланс не уменьшится.'
				|;uk='На жаль, на даний момент реєстр ПДВ працює нестабільно.
    			| Картка контрагента сформована без заповнення даних з оподаткування.
    			| Запустіть повторно заповнення картки через кілька хвилин. При повторному заповненні картки сьогодні до 23:59 Ваш баланс не зменшиться.'");	
	ИначеЕсли КодОшибки=3 Тогда
		Возврат	НСтр("ru='К сожалению, на данный момент реестры НДС и единого налога работают нестабильно. 
				|Карточка контрагента сформирована без заполнения данных по налогообложению. 
				|Запустите повторно заполнение карточки через несколько минут. При повторном заполнении карточки сегодня до 23:59 Ваш баланс не уменьшится.'
				|;uk='На жаль, на даний момент реєстри ПДВ і єдиного податку працюють нестабільно.
    			| Картка контрагента сформована без заповнення даних з оподаткування.
    			| Запустіть повторно заповнення картки через кілька хвилин. При повторному заповненні картки сьогодні до 23:59 Ваш баланс не зменшиться.'");	
	ИначеЕсли КодОшибки=4 Тогда
		Возврат	НСтр("ru='К сожалению, на данный момент Единый государственный реестр работает нестабильно. 
				|Карточка контрагента не заполнена. Запустите повторно заполнение карточки через несколько минут. 
				|При повторном заполнении карточки сегодня до 23:59 Ваш баланс не уменьшится.'
				|;uk='На жаль, на даний момент Єдиний державний реєстр працює нестабільно.
    			| Картка контрагента не заповнена. Запустіть повторно заповнення картки через кілька хвилин.
    			| При повторному заповненні картки сьогодні до 23:59 Ваш баланс не зменшиться.'");
	ИначеЕсли КодОшибки=5 Тогда
		Возврат	НСтр("ru='К сожалению, на данный момент Единый государственный реестр работает нестабильно. 
				|Карточка запрашиваемого контрагента не заполнена. Запустите повторно заполнение карточки через несколько минут. 
				|При повторном заполнении карточки сегодня до 23:59 Ваш баланс не уменьшится.'
				|;uk='На жаль, на даний момент Єдиний державний реєстр працює нестабільно.
    			| Картка контрагента не заповнена. Запустіть повторно заповнення картки через кілька хвилин.
    			| При повторному заповненні картки сьогодні до 23:59 Ваш баланс не зменшиться.'");
	Иначе
		Возврат "";			
	КонецЕсли;
КонецФункции

Процедура ЗаписатьДополнительныеСведенияКонтрагентов(КонтрагентСсылка, ДанныеПактум)
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей = РегистрыСведений.Пактум_ДополнительныеСведенияОКонтрагентах.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(КонтрагентСсылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	ТекПериод = ТекущаяДата();
	Для Каждого Элемент Из ДанныеПактум.ViewList Цикл
		Если ТипЗнч(Элемент.Значение) <> Тип("Структура") И ТипЗнч(Элемент.Значение) <> Тип("Массив") Тогда
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда
			Если ТипЗнч(Элемент.Значение.value) = Тип("Строка") Тогда
				ТекЗапись = НаборЗаписей.Добавить();
				ТекЗапись.Период = ТекПериод;
				ТекЗапись.Контрагент = КонтрагентСсылка;
				ТекЗапись.ИД = Элемент.Ключ;
				ТекЗапись.Значение = Элемент.Значение.value;
				ТекЗапись.Представление = Элемент.Значение.field;
				ТекЗапись.Заголовок = Элемент.Значение.header;
				ТекЗапись.ЕстьОтступ = Элемент.Значение.margin;
				ТекЗапись.Сортировка = Элемент.Значение.level;
				НаборЗаписей.Записать();
			Иначе
				//Таблица...
				Если ТипЗнч(Элемент.Значение.value) = Тип("Массив") Тогда
					ТекЗапись = НаборЗаписей.Добавить();
					ТекЗапись.Период = ТекПериод;
					ТекЗапись.Контрагент = КонтрагентСсылка;
					ТекЗапись.ИД = Элемент.Ключ;
					ТекЗапись.Представление = Элемент.Значение.field;
					ТекЗапись.Заголовок = Элемент.Значение.header;
					ТекЗапись.ЕстьОтступ = Элемент.Значение.margin;
					ТекЗапись.Сортировка = Элемент.Значение.level;
					НаборЗаписей.Записать();
					
					Для Каждого ТаблицаСтрока Из Элемент.Значение.value Цикл
						Если ТипЗнч(ТаблицаСтрока) = Тип("Структура") И ТипЗнч(ТаблицаСтрока.value) = Тип("Массив") Тогда
							ИндексСтроки = 0;
							Для Каждого ЗначенияКолонок Из ТаблицаСтрока.value Цикл
								Если ТипЗнч(ЗначенияКолонок) = Тип("Структура") Тогда
									ИндексКолонки = 0;
									Для Каждого ТаблицаКолонка Из ЗначенияКолонок Цикл
										Если ЗначениеЗаполнено(ТаблицаКолонка.Значение.value) Тогда
											ТекЗапись = НаборЗаписей.Добавить();
											ТекЗапись.Период = ТекПериод;
											ТекЗапись.Контрагент = КонтрагентСсылка;
											ТекЗапись.ИД = Элемент.Ключ + "_" + Строка(ИндексСтроки) + "_" + Строка(ИндексКолонки);
											ТекЗапись.Значение = ТаблицаКолонка.Значение.value;
											ТекЗапись.Представление = ТаблицаКолонка.Значение.field;
											ТекЗапись.Заголовок = ТаблицаКолонка.Значение.header;
											ТекЗапись.ЕстьОтступ = ТаблицаКолонка.Значение.margin;
											Если Не ТекЗапись.ЕстьОтступ Тогда 
												Если ИндексСтроки > 0 И ИндексКолонки = 0 Тогда
													ТекЗапись.ЕстьОтступ = Истина;
												КонецЕсли;
											КонецЕсли;
											ТекЗапись.Сортировка = ТаблицаКолонка.Значение.level;
											НаборЗаписей.Записать();
											
											ИндексКолонки = ИндексКолонки + 1;
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
								ИндексСтроки = ИндексСтроки + 1;
							КонецЦикла;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Массив") Тогда
			Если Не ПустаяСтрока(Элемент.Значение.field) Тогда
				ТекЗапись = НаборЗаписей.Добавить();
				ТекЗапись.Период = ТекПериод;
				ТекЗапись.Контрагент = КонтрагентСсылка;
				ТекЗапись.ИД = Элемент.Ключ;
				//ТекЗапись.Значение = Элемент.Значение.value;
				ТекЗапись.Представление = Элемент.Значение.field;
				ТекЗапись.Заголовок = Элемент.Значение.header;
				ТекЗапись.ЕстьОтступ = Элемент.Значение.margin;
				ТекЗапись.Сортировка = Элемент.Значение.level;
			
				НаборЗаписей.Записать();	
			КонецЕсли;
			РодительИД = Элемент.Ключ;
			РодительСортировкаСтрока = Строка(Элемент.Значение.level);
			Для Каждого ЭлМассива Из Элемент.Значение Цикл
				Если ТипЗнч(ЭлМассива.Значение) <> Тип("Структура") Тогда
					Продолжить;
				КонецЕсли;
				
				ТекЗапись = НаборЗаписей.Добавить();
				ТекЗапись.Период = ТекПериод;
				ТекЗапись.Контрагент = КонтрагентСсылка;
				ТекЗапись.ИД = РодительИД + "_" + ЭлМассива.Ключ;
				ТекЗапись.Значение = ЭлМассива.Значение.value;
				ТекЗапись.Представление = ЭлМассива.Значение.field;
				ТекЗапись.Заголовок = ЭлМассива.Значение.header;
				ТекЗапись.ЕстьОтступ = ЭлМассива.Значение.margin;
				ТекЗапись.Сортировка = Число(РодительСортировкаСтрока + "." + Строка(ЭлМассива.Значение.level));
			
				НаборЗаписей.Записать();
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура Пактум_ЗавершениеПоиска(Параметры, фОшибки=Ложь, ТекстОшибки="")
	пЕДРПОУ=Параметры.ЕДРПОУ;
	КонтрагентСсылка = Параметры.КонтрагентСсылка;
	Если Не фОшибки Тогда
		//Запишем Налогообложение
		Если Параметры.Налогообложение.Свойство("СистемаНалогообложенияТекст") Тогда
			Если ЗначениеЗаполнено(Параметры.Налогообложение.СистемаНалогообложенияТекст) Тогда
				Если КонтрагентСсылка=Справочники.Контрагенты.ПустаяСсылка() Тогда
					КонтрагентСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("КодПоЕДРПОУ", пЕДРПОУ);
				КонецЕсли;
				НаборЗаписей=Неопределено;
				Если Параметры.Конфигурация="УНФ" Тогда
					Если КонтрагентСсылка=Справочники.Контрагенты.ПустаяСсылка() Тогда
						КонтрагентСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", пЕДРПОУ);
					КонецЕсли;
					НаборЗаписей = РегистрыСведений.СистемыНалогообложенияКонтрагентов.СоздатьНаборЗаписей();
					ИмяРекв="СистемаНалогообложения";
					Если Параметры.Налогообложение.СистемаНалогообложенияТекст="ЕдиныйНалог" Или
							Параметры.Налогообложение.СистемаНалогообложенияТекст="ЕдиныйНалогИНДС" Тогда
						Параметры.Налогообложение.Вставить("СистемаНалогообложения", Перечисления.СистемыНалогообложения.Упрощенная);
					ИначеЕсли Параметры.Налогообложение.СистемаНалогообложенияТекст="НалогНаПрибыль" Или
							Параметры.Налогообложение.СистемаНалогообложенияТекст="НалогНаПрибыльИНДС" Или
							Параметры.Налогообложение.СистемаНалогообложенияТекст="НеПлательщик" Тогда
						Параметры.Налогообложение.Вставить("СистемаНалогообложения", Перечисления.СистемыНалогообложения.Общая);
					КонецЕсли;
				ИначеЕсли Лев(Параметры.Конфигурация, 2) = "БП" Тогда
					НаборЗаписей = РегистрыСведений.СхемыНалогообложенияКонтрагентов.СоздатьНаборЗаписей();
					НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
					ИмяРекв="СхемаНалогообложения";
					Если Параметры.Налогообложение.СистемаНалогообложенияТекст="ЕдиныйНалог" Тогда
						Параметры.Налогообложение.Вставить("СистемаНалогообложения", Справочники.СхемыНалогообложения.ЕдиныйНалог);
					ИначеЕсли Параметры.Налогообложение.СистемаНалогообложенияТекст="ЕдиныйНалогИНДС" Тогда
						Параметры.Налогообложение.Вставить("СистемаНалогообложения", Справочники.СхемыНалогообложения.ЕдиныйНалогИНДС);
					ИначеЕсли Параметры.Налогообложение.СистемаНалогообложенияТекст="НалогНаПрибыль" Тогда
						Параметры.Налогообложение.Вставить("СистемаНалогообложения", Справочники.СхемыНалогообложения.НалогНаПрибыль);
					ИначеЕсли Параметры.Налогообложение.СистемаНалогообложенияТекст="НалогНаПрибыльИНДС" Тогда
						Параметры.Налогообложение.Вставить("СистемаНалогообложения", Справочники.СхемыНалогообложения.НалогНаПрибыльИНДС);
					ИначеЕсли Параметры.Налогообложение.СистемаНалогообложенияТекст="НеПлательщик" Тогда
						Параметры.Налогообложение.Вставить("СистемаНалогообложения", Справочники.СхемыНалогообложения.НеПлательщик);
					КонецЕсли;
				КонецЕсли;
				Если Не НаборЗаписей=Неопределено Тогда
					НаборЗаписей.Отбор.Период.Установить(Параметры.Налогообложение.ПериодНалогообложения);
					НаборЗаписей.Отбор.Контрагент.Установить(КонтрагентСсылка);
					НаборЗаписей.Прочитать();
					Если НаборЗаписей.Количество() = 0 Тогда
						НовыйНомер = НаборЗаписей.Добавить();
						НовыйНомер.Контрагент = КонтрагентСсылка;
						НовыйНомер.Период = Параметры.Налогообложение.ПериодНалогообложения;
						НовыйНомер[ИмяРекв] = Параметры.Налогообложение.СистемаНалогообложения;
					ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
						НовыйНомер = НаборЗаписей[0];
						НовыйНомер.Контрагент = КонтрагентСсылка;
						НовыйНомер.Период = Параметры.Налогообложение.ПериодНалогообложения;
						НовыйНомер[ИмяРекв] = Параметры.Налогообложение.СистемаНалогообложения;
					КонецЕсли;
					Если Параметры.Налогообложение.Свойство("ГруппаНалогоОбложения") Тогда
						НовыйНомер.ГруппаПлательщикаЕдиногоНалога = Параметры.Налогообложение.ГруппаНалогоОбложения;	
					КонецЕсли;
					НаборЗаписей.Записать();	
				Иначе
					Попытка
						Если ЗначениеЗаполнено(КонтрагентСсылка.ИННПлательщикаНДС) И Найти(Параметры.Налогообложение.СистемаНалогообложенияТекст, "НДС")>0 Тогда
							Если Не КонтрагентСсылка.ПлательщикНДС Тогда
								Об=КонтрагентСсылка.ПолучитьОбъект();
								Об.ПлательщикНДС=Истина;
								Об.Записать();
							КонецЕсли;
						Иначе
							Если КонтрагентСсылка.ПлательщикНДС Тогда
								Об=КонтрагентСсылка.ПолучитьОбъект();
								Об.ПлательщикНДС=Ложь;
								Об.Записать();
							КонецЕсли;
						КонецЕсли;
					Исключение
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
			//Если Налогообложение.ОчиститьИНН Тогда
			Если Найти(Параметры.Налогообложение.СистемаНалогообложенияТекст, "НДС")=0 Тогда
				Попытка
					Об=КонтрагентСсылка.ПолучитьОбъект();
					Об.ИНН="";
					Об.Записать();
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

	пНабор=РегистрыСведений.Пактум_ФоновыеЗадания.СоздатьНаборЗаписей();
	Попытка
		НовСтр=пНабор.Добавить();
		НовСтр.УИД=Параметры.УИД;
		НовСтр.фОшибки=фОшибки;
		НовСтр.ТекстОшибки=ТекстОшибки;
		пНабор.Записать();
	Исключение
	КонецПопытки;
КонецПроцедуры

Функция Адрес_ТипДома(Зн) 
	Возврат "Дом"; 
КонецФункции

Функция Адрес_ТипКорпуса(Зн)
	Возврат "Корпус";	
КонецФункции

Функция Адрес_ТипКвартиры(Зн)
	ТипПомещения = "Квартира";
	
	Если Зн="кімн." Тогда
		ТипПомещения = "Комната";
	ИначеЕсли Зн="прим." Тогда
		ТипПомещения = "Помещение";
	ИначеЕсли Зн="оф." Тогда
		ТипПомещения = "Офис";	
	КонецЕсли;
	
	Возврат ТипПомещения;
	
КонецФункции
